[
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "81defaf3-8db6-4944-8430-282b77b30abf",
    "numberId": "2176",
    "title": "Customer Service Representative",
    "salary": "$45,000.00",
    "location": "MEDLEY, FL",
    "type": "Full Time",
    "createdAt": "2025-07-28T17:02:06.737448",
    "description": "<p>Our client is a leading provider of industrial and construction supplies seeking a Full-Time Customer Service Representative to join their team. This role requires a detail-oriented individual with strong customer service skills and a high level of accuracy in data entry. The ideal candidate will be proactive, reliable, and committed to delivering exceptional support to customers while maintaining accurate records and order information.</p><p>&nbsp;</p><p><strong>Benefits:</strong></p><ul><li>Health Insurance</li><li>401K with employer match</li><li>PTO &amp; Sick leave</li><li>Direct Hire</li></ul><p>&nbsp;</p><p><strong>Payrate:</strong></p><ul><li>$19/hr - $22/hr (based on experience)</li></ul><p><br></p>",
    "requirements": "<ul><li>Proficient with ERP systems; Macola knowledge is a plus.</li><li>Minimum 3+ years of Experience in Customer Service</li><li>Experience in the HVAC industry is a strong asset.</li><li>Strong interpersonal and written skills.</li><li>Accurate in data entry and record-keeping.</li><li>Proactive and efficient in addressing customer issues.</li><li>Bilingual (Spanish/English) preferred, but not required.</li></ul><p><br></p>",
    "responsibilities": "<p><br></p><ul><li>Communicate with customers via phone, email, and chat to provide product and service information, respond to inquiries, and resolve concerns in a timely and professional manner.</li><li>Support customers with order processing, billing inquiries, and troubleshooting issues to ensure a seamless and positive experience.</li><li>Build and maintain strong, positive relationships with customers through clear, empathetic, and effective communication.</li><li>Accurately process orders, manage customer data, and streamline service workflows using ERP systems (Macola experience preferred).</li><li>Understand customer needs and recommend appropriate products or services to help them achieve their goals.</li><li>Maintain up-to-date and accurate customer records with a strong attention to detail.</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "94c419c2-33b0-4ffc-84a6-de16395b13a1",
    "numberId": "2233",
    "title": "DZ Driver",
    "salary": "$24.00",
    "location": "WHITBY, ON",
    "type": "Full Time",
    "createdAt": "2025-12-15T18:46:14.870286",
    "description": "<p>A well-established transportation service provider is looking for an experienced <strong>DZ Driver</strong> to join their growing operations in <strong>Durham Region (Whitby, ON)</strong>. This is a full-time, long-term opportunity for a dependable and safety-focused professional.</p><p><br></p><p>Apply Online or call us at 647-660-4440 ext. 408. You can also send us your resume at recruitment@covenantgroupl.com with internal #2233 on the subject</p><p><br></p><p><strong>WE OFFER:</strong></p><ul><li>Training in the fuel trucks is provided</li><li>Tons of overtime offered (nights and weekends)</li><li>Weekly payments</li></ul><p><strong>PAY RATE:</strong></p><ul><li>$24 .00/hour</li></ul><p><strong>Schedule:</strong></p><ul><li>Primarily daytime shifts. Operation runs 24/7 — must be available for weekend and evening shifts as required.</li><li>Overtime after 50 hours.</li></ul><p><br></p>",
    "requirements": "<ul><li>Must be able to operate manual transmission trucks (6-, 8-, and 10-speed)</li><li>Minimum <strong>2+ years of DZ or AZ driving experience</strong></li><li>Experience or knowledge of fuel handling, fuel types, terminal loading, and fueling regulations (training provided)</li><li>Ability to work extended hours, nights, and weekends when needed</li><li>Comfortable using onboard computers and electronic logging systems</li><li>Reliable, punctual, and able to work with minimal supervision</li><li>Strong customer service and communication skills</li></ul><p><br></p>",
    "responsibilities": "<ul><li>Deliver fuel safely to various locations, including construction sites and service stations across the GTA</li><li>Perform daily vehicle inspections and ensure equipment is operating safely</li><li>Complete required driver documentation and delivery logs</li><li>Assist with installation or removal of portable tanks and pumps when required</li><li>Follow all safety protocols, fueling procedures, and regulatory requirements</li><li>Maintain strong customer service and communication with dispatch</li><li>Operate onboard truck technology and follow assigned routes</li><li>Work independently and manage time efficiently</li></ul><p><br></p>",
    "shift": "Mon-Fri 07:00 to 17:00",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "1733d160-5c5f-4f0c-b7c2-880bd631c3d9",
    "numberId": "2171",
    "title": "DZ Driver - Fuel/Oil Delivery ",
    "salary": "$24.00",
    "location": "TORONTO, ON",
    "type": "Full Time",
    "createdAt": "2025-06-11T14:26:43.022913",
    "description": "<p>Our Client, a delivery company servicing over 30 years in business based in the downtown Toronto area with multiple locations is currently seeking a full-time qualified DZ Fuel Drivers.</p><p><br></p><p>We are looking to hire as soon as possible!!!!</p><p><br></p><p>We Offer:</p><p>Weekly payments</p><p>Long-term and full-time</p><p>Opportunities for growth</p><p><br></p><p><br></p><p>Schedule:</p><p>Primarily daytime shifts</p><p>7 AM - 5 PM (approx)</p><p>Operation runs 24/7 — must be available for weekend and evening shifts as required.</p><p>Tons of overtime offered (nights and weekends)</p><p><br></p><p>Overtime after 50 hours.</p><p><br></p>",
    "requirements": "<ul><li>At least 2 years of experience</li><li>Clean Abstract and CVOR</li><li>Manual transmission 6, 8 &amp; 1O Speed trucks</li><li>Fuel delivery knowledge about the different fuels, fuel delivery, fuel rules, the applications of fuel, loading at terminals, etc.</li><li>Must be able to work under minimal supervision</li><li>Must be reliable in maintaining a good customer service relationship</li><li>Must be comfortable with onboard computer technology</li><li>Flexible to extended workdays, nights, and weekends when needed if available</li></ul><p><br></p>",
    "responsibilities": "<ul><li>Delivering wholesale petroleum services in the GTA area</li><li>Daily vehicle inspection Complete necessary driver’s paperwork</li><li>Installing and de-installing tanks and pumps</li><li>Delivering at construction sites and gas stations.</li><li>Training in the fuel trucks is provided</li></ul><p><br></p><p>.</p>",
    "shift": "Mon-Fri 07:00 to 17:00",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "74119d3b-4602-41fc-bfd3-84e95f6baabd",
    "numberId": "1092",
    "title": "Forklift Operator ",
    "salary": "$20.50",
    "location": "WOODBRIDGE, ON",
    "type": "Full Time",
    "createdAt": "2021-09-22T17:31:38.982107",
    "description": "<p>A leading exhaust fan manufacturing company based in Woodbridge area is immediately looking for a Full-Time Forklift Operator to work in their sheet metal fabrication plant.</p><p><br></p><p><strong>HOW TO APPLY:</strong></p><p><br></p><p>If you are interested, apply online or contact us today at 647-660-4440 ext. 402. You can also send us your resume by email to recruitment@covenantgroupl.com with <strong>your name and subject #1092</strong></p><p><br></p><p><strong>We offer:</strong></p><p><br></p><ul><li>Stable and growing company with long tenured employees</li><li>Very friendly environment to work in and laid-back environment</li><li>Weekly paychecks</li></ul><p><br></p><p><br></p><p><strong>Pay rate</strong>: $19 - $20.50/hr. based on experience.</p><p><br></p><p><strong>Schedule:</strong></p><p>Monday -Friday 8:00 am- 4:30 pm</p><p>\n</p><p><br></p>",
    "requirements": "<ul><li> 2 years of experience as a Forklift Operator </li><li>Valid counterbalance License</li><li>Skilled in operating forklifts in narrow aisles and confined areas</li></ul>",
    "responsibilities": "<ul><li>Manages the shipment and receipt of all products, materials, and supplies</li><li>Collaborates and communicates with logistics technicians, customer service representatives, service providers, and others involved in the shipment and receipt of products</li><li>Tracks, traces, and updates the status of incoming and outgoing shipments</li><li>Maintains a clean, neat, and member-ready area.</li><li>Promptly unloads trucks and deliveries and sorts and stocks receivables</li><li>Maintains an accurate log sheet of daily moves, scanning inventory, and counting accurately.</li><li>Engages with vendors and drivers with a positive attitude</li><li>Provides additional backup support for shipping and receiving departments</li></ul>",
    "shift": "Mon-Fri 08:00 to 16:30",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "3eca90b9-aadf-4b2a-8c8f-d36185270de0",
    "numberId": "2158",
    "title": "Forklift Operator (Thu - Sun)",
    "salary": "$20.00",
    "location": "GEORGETOWN, ON",
    "type": "Full Time",
    "createdAt": "2025-02-14T14:02:28.234775",
    "description": "<p>A distribution Center Company located in Milton/Halton Hills is currently seeking a Full-Time</p><p><br></p><p>Forklift Operator to start immediately.</p><p><br></p><p>HOW TO APPLY:</p><p>Apply to the online to this job or/and send us your resume by email to recruitment@covenantgroupl.com with your name and internal#1654 on the subject.</p><p><br></p><p>WE OFFER:</p><p>Weekly paychecks</p><p><br></p><p>Pay Rate: $20/hr. Schedule: Afternoon Shift</p><p>Thu- Sun from 3:30pm to 1:30 am</p><p>Important: Shift on weekend (Fri-Sun) are subject to change. Must be flexible  </p><p><br></p>",
    "requirements": "<p>A valid license for operation of Dock Stocker and Walkie is a must! </p><p>2+ years of experience operating above equipment in a warehouse environment (accident-free)</p><p>Must be flexible to work other shifts on the weekends (Fri-Sun)</p><p> Must have previous Shipping Receiving experience a huge asset </p><p>Prior experience in a fast-paced warehouse preferred </p><p>Prior experience in a multi-temperature environment an asset Knowledge of produce is an asset </p><p>May be required to work longer than the scheduled work hours </p><p>Has a history of good attendance and adherence to the work schedule </p>",
    "responsibilities": "<p>Offloads product from trucks and provides for rotation on a “first in-first out” basis unless otherwise specified by a supervisor</p><p>- Operate a forklift, pump truck or an electric pallet jack safely and efficiently</p><p>- Stacks pallets correctly, i.e., heavy products used as the base, light and delicate products on top</p><p>- Stages products in the cooler, warehouse and on the dock to ensure that only quality products are accessible for selection and delivery to customers, and consults with the supervisor, quality control specialist or purchaser when there is a doubt about the quality</p><p>- Responsible for the accuracy and quality of all products shipped or received</p><p>- Actively inspects a minimum of two cases per pallet for all pallets received</p><p>- Demonstrates a working knowledge of our products</p><p>- Stores all received product in the designated areas or communicates with the supervisor if product has not been stored in the designated area</p><p>- Notifies supervisor or purchaser when special or non-stock items have been received and stored</p><p>- Inspects all incoming trucks according to company guidelines. (temperature, cleanliness and sanitation)</p><p>- Records all deliveries in log</p><p>- Processes P. O’s (purchase orders) in Warehouse Management System after receiving a physical product</p><p><br></p>",
    "shift": "Sun-Thu-Fri-Sat 15:30 to 01:30",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "57e27e93-f8cf-4865-b330-b89ac484cb2f",
    "numberId": "2043",
    "title": "Machine Operator (Manufacturing Equipment Operator) ",
    "salary": "$37,440.00",
    "location": "MIAMI, FL",
    "type": "Full Time",
    "createdAt": "2024-07-26T15:52:33.150358",
    "description": "<p>A Florida-based family-owned company in the tobacco industry is looking for a successful and motivated <strong>Production Machine Operator </strong>to start immediately.</p><p><br></p><p><strong>WE OFFER</strong></p><p><br></p><ul><li>Direct hiring by the company</li><li>Medical insurance</li><li>401k (50%matching)</li><li>Profit sharing</li><li>Paid holidays</li><li>Paid Time Off</li></ul><p><br></p><p><strong>PAY RATE</strong>: $18/hr.</p><p><br></p><p><strong>Hours: Must have flexibility to work rotating shifts (Day or Night shift) Mon-Fri</strong></p><p><br></p><p><strong>Week 1</strong> - 5:30 AM - 2:10 PM</p><p><strong>Week 2</strong> - 2 PM - 10:40 PM</p><p><br></p>",
    "requirements": "<ul><li>2+ experience as a Machine Operator</li><li>Excellent organizational and communication skills</li><li>Bilingual; fluent in Spanish</li><li>Attention to detail</li><li>Ability to work in a fast-paced environment</li><li>Previous experience working in the Manufacturing industry</li><li>Working knowledge of GMP (Good Manufacturing Practices)</li><li>Good housekeeping, hygiene, sanitation, and pest control practices</li></ul><p><br></p><p><strong>HOW TO APPLY</strong></p><p><br></p><p>If you are interested, apply online or contact us today at 954 932 0477 Ext 402. You can also send us your resume at recruitment@sigook.com with <strong>your name and order 2043 on the subject.</strong></p><p><br></p><p>Looking forward to hearing from you!</p><p><br></p>",
    "responsibilities": "<ul><li>Follows start-up procedure to properly start-up machine</li><li>Ensures proper weight, size and pressure</li><li>Removes the finished filters and places them in boxes</li><li>Ensures that properly made filters are correctly stacked and stored in the raw materials warehouse</li><li>Ensures that all activities are followed based on procedures, as well as ISO 9001 requirements and FDA, GMP, OSHA, &amp; EPA regulations</li><li>Monitors Data Edge system and takes appropriate samples at set times and records all required information on production report</li><li>Performs a proper shut down at the end of the shift</li><li>Executes and records all duties listed in the cleaning checklist</li><li>Performs minor mechanical adjustments, as per training</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "6c300d42-a699-4c2e-bc31-c126540b84d3",
    "numberId": "2156",
    "title": "Manufacturing Support Associate/Forklift",
    "salary": "$17.00",
    "location": "MIAMI, FL",
    "type": "Full Time",
    "createdAt": "2025-02-11T16:25:44.807339",
    "description": "<p>A Florida-based family-owned company in the tobacco industry is looking for a diligent<strong><em> </em>Material Handler/Forklift Operator</strong> to join their team and support their manufacturing process.</p><p><br></p><p><strong>WE OFFER</strong></p><p><br></p><ul><li>Direct hiring by the company</li><li>Medical insurance</li><li>401k (50%matching)</li><li>Profit sharing</li><li>Paid holidays</li><li>Paid Time Off</li></ul><p><br></p><p><strong>PAY RATE</strong>: $17/hr.</p><p><br></p><p><strong>Hours: Must have flexibility to work rotating shifts (Day or Afternoon shift) Mon-Fri</strong></p><p><br></p><p><strong>Week 1</strong> - 5:30 AM - 2:10 PM</p><p><strong>Week 2</strong> - 2 PM - 10:40 PM</p>",
    "requirements": "<ul><li>2+ years of experience as a Forklift Operator, including sit-down and stand-up machines</li><li>Valid forklift license</li><li>Excellent organizational and communication skills</li><li>Bilingual; fluent in Spanish</li><li>Strong attention to detail</li><li>Ability to work in a fast-paced environment</li><li>Previous experience in the manufacturing industry</li><li>Working knowledge of GMP (Good Manufacturing Practices)</li><li>Familiarity with good housekeeping, hygiene, sanitation, and pest control practices</li></ul><p><br></p><p><strong style=\"color: rgb(54, 54, 54);\">HOW TO APPLY</strong></p><p><br></p><p>If you are interested, apply online or contact us today at 954 932 0477 Ext 402. You can also send us your resume at recruitment@sigook.com with <strong style=\"color: rgb(54, 54, 54);\">your name and order 2156 on the subject.</strong></p><p><br></p><p>Looking forward to hearing from you!</p><p><br></p><p><br></p><p><br></p>",
    "responsibilities": "<ul><li>Receive and inspect incoming shipments for accuracy and quality</li><li>Ensure a constant flow of materials and supply materials to the machines</li><li>Pick and pack orders according to customer specifications and delivery schedules</li><li>Operate electric pallet jacks and forklifts</li><li>Be responsible for all robot functions</li><li>Create labels as needed</li><li>Record and report any malfunctions or deviations</li><li>Adhere to all applicable regulations, policies, and procedures for health and safety</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "80394bd6-0096-49de-9561-7b33064454d4",
    "numberId": "2231",
    "title": "Sales Executive",
    "salary": "$82,500.00",
    "location": "MIAMI, FL",
    "type": "Full Time",
    "createdAt": "2025-11-20T18:35:24.045954",
    "description": "<p>A leading logistics company is seeking an experienced Sales Executive to drive business growth across our freight forwarding and 3PL operations. This role focuses on developing new customer relationships, expanding existing accounts, and promoting our portfolio of logistics services, including ocean, air, and ground transportation, as well as warehousing. The ideal candidate is results-driven, proactive, and deeply familiar with Miami’s logistics ecosystem.</p><p><br></p><p><strong>Salary and benefits: </strong></p><p><br></p><ul><li>$75,000 – $95,000 (depending on experience) + commissions.</li><li>Comprehensive benefits package, including medical, dental, and vision insurance</li><li>Long Term Disability</li><li>Life insurance</li><li>Paid Time Off</li><li>401(K) matching up to 4%</li></ul>",
    "requirements": "<ul><li>3–5 years of experience in B2B sales within logistics, freight forwarding, or 3PL services.</li><li>Proven success generating $3M+ in annual revenue.</li><li>Strong knowledge of ocean, air, and ground freight operations.</li><li>Excellent communication and negotiation skills in English and Spanish.</li><li>Self-motivated, organized, and able to work independently.</li><li>Bachelor’s degree preferred (International Business, Logistics, or related field).</li></ul><p><br></p>",
    "responsibilities": "<ul><li>Develop new business opportunities for freight forwarding, warehousing, and transportation services.</li><li>Manage the full sales cycle: prospecting, client visits, quoting, follow-up, and closing.</li><li>Build and maintain a strong sales pipeline using CRM tools or Google Sheets tracking.</li><li>Prepare tailored proposals that align with client requirements and company capabilities.</li><li>Coordinate with operations and admin teams to ensure successful onboarding and client satisfaction.</li><li>Represent the company at trade shows and networking events to increase brand visibility.</li><li>Analyze sales performance and report progress weekly to management.</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "e29027cc-c839-47ca-bf35-40afe77777cc",
    "numberId": "2194",
    "title": "Sales Partner – Food & Beverage Industry (Commission-Based, Independent Contractor)",
    "salary": "$0.00",
    "location": "MISSISSAUGA, ON",
    "type": "Contractor",
    "createdAt": "2025-09-03T18:36:32.851093",
    "description": "<p><em>(Remote – Across Canada, excluding Quebec)</em></p><p><br></p><p><strong>About Us</strong></p><p><br></p><p class=\"ql-align-justify\">COVENANT GROUP LTD. is a <strong>licensed staffing and employment services agency headquartered in Toronto</strong>, operating nationwide. We specialize in connecting skilled talent with employers across <strong>food &amp; beverage manufacturing, processing, packaging, distribution, and related industries</strong>.</p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">We are expanding and seeking <strong>ambitious, business-minded Sales Partners</strong> with strong connections in the <strong>food and beverage sector</strong>. This is a <strong>commission-only, independent contractor opportunity</strong> with a <strong>highly competitive and transparent compensation plan</strong> shared during the screening process.</p><p><br></p><p><strong>What We Offer</strong></p><p><br></p><ul><li><strong>Nationwide reach</strong> – ability to serve food &amp; beverage employers across Canada (excluding Quebec).</li><li><strong>Full independence</strong> – remote role, set your own schedule, grow your own business.</li><li><strong>Uncapped earning potential</strong> – the more you sell, the more you earn.</li><li><strong>Back-office support</strong> – powered by a licensed staffing agency with established compliance and recruitment operations.</li></ul><p><br></p><p><strong>Contract Terms (Important Disclaimer)</strong></p><p><br></p><p>This is an <strong>independent contractor opportunity</strong> – not an employee position.</p><ul><li><strong>No base salary, payroll deductions, or benefits.</strong></li><li>Income reported via <strong>T4A slip</strong>.</li><li>Contractors must provide a valid <strong>Business Number (BN) or SIN</strong> and handle their own <strong>taxes, CPP, and GST/HST remittances</strong>.</li></ul><p><br></p><p><strong>How to Apply</strong></p><p><br></p><p>If you’re a proven sales professional with <strong>food &amp; beverage industry connections</strong> and are ready to partner with a licensed staffing agency:</p><p>👉 Send your <strong>resume</strong> and a <strong>short cover letter</strong> highlighting your sales experience, your book of business, and confirming you are not under a non-compete.</p><p> Apply via <a href=\"http://www.covenantgroupl.com/\" target=\"_blank\"><strong>www.covenantgroupl.com</strong></a><strong> </strong>or email us at <a href=\"mailto:management@covenantgroupl.com\" target=\"_blank\"><strong>management@covenantgroupl.com</strong></a><strong> </strong></p>",
    "requirements": "<ul><li><strong>Proven B2B sales experience</strong> (staffing, HR, food &amp; beverage supply chain, or related industry preferred).</li><li><strong>Existing book of business or strong F&amp;B industry connections</strong> is a major asset.</li><li>Entrepreneurial, self-driven, and results-focused mindset.</li><li>Not currently bound by a valid <strong>non-compete agreement</strong> with another staffing firm.</li><li>Authorized to work in Canada</li></ul>",
    "responsibilities": "<ul><li><strong>Close deals and drive sales</strong> – manage the full cycle from prospecting to signed agreements.</li><li><strong>Leverage your existing network</strong> in food &amp; beverage and start generating commissions from day one.</li><li>Build and grow relationships with decision-makers in <strong>food processing, manufacturing, distribution, and retail supply chains</strong>.</li><li>Promote and sell our <strong>staffing solutions</strong> (temporary, contract, and permanent placements).</li><li>Expand your territory and establish long-term client partnerships.</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "438cd5d9-9d84-4ee0-97ff-ffc20ab1521b",
    "numberId": "2191",
    "title": "Sales Partner – Food & Beverage Industry (Independent Contractor, Remote)",
    "salary": "$0.00",
    "location": "FORT LAUDERDALE, FL",
    "type": "Contractor",
    "createdAt": "2025-09-03T17:18:48.290957",
    "description": "<h3><em>(Nationwide – United States)</em></h3><h3><br></h3><p><strong>About Us</strong></p><p><br></p><p class=\"ql-align-justify\">SIGOOK Work Factory is a <strong>licensed staffing and employment services agency</strong> providing workforce solutions across the United States. We specialize in connecting skilled talent with employers in <strong>food &amp; beverage manufacturing, processing, packaging, distribution, and related sectors</strong>.</p><p><br></p><p>We are expanding our reach and seeking <strong>experienced Sales Partners with strong connections in the food &amp; beverage industry</strong>. This is a <strong>1099 independent contractor opportunity</strong> — ideal for motivated sales professionals who want to maximize earnings without the limitations of a traditional payroll role.</p><p><br></p><h3><strong>Role Overview</strong></h3><p><br></p><p>As a Sales Partner, you will <strong>generate new business opportunities, build long-lasting client relationships, and promote our staffing solutions nationwide</strong>. This is a <strong>commission-only role</strong> with a <strong>highly competitive and transparent compensation plan</strong>, disclosed during the screening process.</p><p><br></p><p>Unlike many agencies, you’ll have the <strong>freedom to conduct business across most of the U.S.</strong>, giving you greater flexibility and <strong>uncapped earning potential</strong>.</p><p><br></p><h3><strong>Compensation</strong></h3><p><br></p><ul><li><strong>Commission-only role (1099 independent contractor).</strong></li><li>Transparent, <strong>lucrative compensation plan</strong> disclosed during screening.</li><li><strong>Uncapped earning potential</strong> — the more you sell, the more you earn.</li></ul><p><br></p><h3><strong>Why Partner With Us</strong></h3><p><br></p><ul><li><strong>Full autonomy</strong> – set your own schedule, work from anywhere in the U.S.</li><li><strong>Nationwide reach</strong> – conduct business with food &amp; beverage employers across most of the United States (a competitive advantage).</li><li><strong>Backed by a licensed staffing agency</strong> with strong compliance and recruitment operations.</li><li>Access to <strong>sales tools</strong> (email, CRM, etc.) to support your business efforts.</li><li><strong>Entrepreneurial role</strong> – high reward for high performance.</li></ul><p><br></p><h3><strong>Contract Type (Disclaimer)</strong></h3><p><br></p><p>This is a <strong>1099 Independent Contractor role</strong>. It is not an employee position. No base salary, payroll deductions, or employee benefits are provided. Compensation is <strong>commission-only</strong>.</p><p><br></p><h3><strong>How to Apply</strong></h3><p><br></p><p>If you are a proven sales professional with <strong>food &amp; beverage industry connections</strong> and ready to grow with a licensed staffing partner:</p><p>Submit your <strong>resume</strong> and a <strong>short cover letter</strong> detailing your sales experience, your book of business, and confirming you are not bound by a non-compete.</p><p> </p><p> </p>",
    "requirements": "<ul><li>Proven <strong>B2B sales experience</strong> (staffing, HR services, or food &amp; beverage supply chain preferred).</li><li>Strong <strong>book of business or client network</strong> in the food and beverage (F&amp;B) industry.</li><li>Excellent networking, communication, and negotiation skills.</li><li>Entrepreneurial mindset: highly self-driven, independent, and results-focused.</li><li>Must not be subject to a current <strong>non-compete or restrictive covenant</strong> with another staffing firm.</li><li>Authorized to work in the United States.</li></ul>",
    "responsibilities": "<ul><li>Identify and engage prospective clients in the <strong>food &amp; beverage sector</strong>, including processing plants, packaging facilities, distributors, and retail supply chains.</li><li>Promote our staffing and recruitment services (temporary, contract, and permanent placements).</li><li>Develop long-term client partnerships and expand your book of business.</li><li>Operate independently to achieve agreed sales goals.</li><li>Provide updates on pipeline and sales activities when required.</li></ul>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "be3fe1c2-87e9-4fed-97fa-b46c71dd52e4",
    "numberId": "2193",
    "title": "Sales Partner Logistics & 3PL – Commission-Based (Independent Contractor)",
    "salary": "$0.00",
    "location": "MISSISSAUGA, ON",
    "type": "Contractor",
    "createdAt": "2025-09-03T18:33:30.563672",
    "description": "<p><em>(Remote – Across Canada, excluding Quebec)</em></p><p><br></p><p><strong>About Us</strong></p><p>COVENANT GROUP LTD. is a <strong>licensed staffing and employment services agency</strong> headquartered in Toronto with business across Canada. We specialize in connecting skilled talent with employers across <strong>logistics, 3PL, warehousing, manufacturing, engineering, and other related industries</strong>.</p><p><br></p><p>We are expanding and seeking <strong>ambitious, business-minded Sales Partners</strong> with strong connections in the <strong>3PL, logistics, and warehousing sectors</strong>. This is a <strong>commission-only, independent contractor role</strong> with a <strong>highly competitive and transparent compensation plan</strong> shared during the screening process.</p><p><br></p><p><strong>What We Offer</strong></p><ul><li><strong>Nationwide reach</strong> – ability to place candidates with clients across most of Canada (excluding Quebec).</li><li><strong>Full independence</strong> – work remotely, set your own schedule, manage your own growth.</li><li><strong>Uncapped commissions</strong> – your earnings grow with your performance.</li><li><strong>Operational support</strong> – backed by a licensed staffing agency with solid compliance and recruitment operations.</li></ul><p><br></p><p><strong>Contract Terms (Important Disclaimer)</strong></p><p>This is an <strong>independent contractor opportunity</strong> – not an employee position.</p><ul><li><strong>No base salary, payroll deductions, or benefits.</strong></li><li>Income is reported via <strong>T4A slip</strong>.</li><li>Contractors must provide a valid <strong>Business Number (BN) or SIN</strong> and are responsible for their own <strong>taxes, CPP, and GST/HST remittances</strong>.</li></ul><p><br></p><p><strong>How to Apply</strong></p><p>If you’re a proven deal-closer with industry connections and ready to partner with a licensed staffing agency:</p><p><br></p><p>Send your <strong>resume</strong> and a <strong>short cover letter</strong> outlining your sales experience, your client base, and confirming you are not under a non-compete.</p><p> Apply via <strong>www.covenantgroupl.com</strong> or email us at <a href=\"mailto:management@covenantgroupl.com\" target=\"_blank\"><strong>management@covenantgroupl.com</strong></a></p>",
    "requirements": "<ul><li><strong>Proven B2B sales experience</strong> (staffing, HR, or related industry preferred).</li><li><strong>Existing book of business or strong industry connections</strong> is a major asset.</li><li>Entrepreneurial drive, self-motivation, and a results-oriented mindset.</li><li>Must not be bound by a current <strong>non-compete agreement</strong> with another staffing firm.</li><li>Authorized to work in Canada.</li></ul><p><br></p>",
    "responsibilities": null,
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  },
  {
    "id": "00000000-0000-0000-0000-000000000000",
    "requestId": "660c9c8f-3de3-4381-8875-113220557c13",
    "numberId": "2192",
    "title": "Sales Partner Logistics & 3PL– Commission-Based (Independent Contractor, Remote)",
    "salary": "$0.00",
    "location": "FORT LAUDERDALE, FL",
    "type": "Contractor",
    "createdAt": "2025-09-03T18:29:27.323326",
    "description": "<p><em>(Nationwide – United States)</em></p><p><br></p><p><strong>About Us</strong></p><p><br></p><p>ABC Staffing is a <strong>licensed staffing and employment services agency</strong> providing workforce solutions across the United States. We specialize in connecting skilled talent with employers in <strong>logistics, 3PL, warehousing, manufacturing, engineering, and related sectors</strong>.</p><p><br></p><p>We are expanding our footprint and seeking <strong>experienced Sales Partners</strong> with strong connections in the <strong>logistics, warehousing, and 3PL industries</strong>. This is a <strong>1099 independent contractor opportunity</strong> — ideal for motivated sales professionals who want to maximize earnings without the limitations of a traditional payroll role.</p><p><br></p><p><strong>Role Overview</strong></p><p><br></p><p>As a Sales Partner, you will <strong>generate new business opportunities, build lasting client relationships, and promote our staffing solutions nationwide</strong>. This is a <strong>commission-only role</strong> with a <strong>highly competitive and transparent compensation plan</strong>, disclosed during the screening process.</p><p><br></p><p>Unlike many agencies, you’ll have the <strong>freedom to conduct business across most of the U.S.</strong>, giving you greater flexibility and uncapped earning potential.</p><p><br></p><p><strong>Compensation</strong></p><ul><li><strong>Commission-only role (1099 independent contractor).</strong></li><li>Transparent, <strong>lucrative compensation plan</strong> disclosed during screening.</li><li><strong>Uncapped earning potential</strong> — the more you sell, the more you earn.</li></ul><p><br></p><p><strong>Why Partner With Us</strong></p><ul><li><strong>Full autonomy</strong> – set your own schedule, work from anywhere in the U.S.</li><li><strong>Nationwide reach</strong> – conduct business across most of the United States (a key competitive advantage).</li><li><strong>Backed by a licensed staffing agency</strong> with strong compliance and recruitment operations.</li><li>Access to <strong>sales tools</strong> (email, CRM, etc.) to support your business efforts.</li><li><strong>Entrepreneurial role</strong> – high reward for high performance.</li></ul><p><br></p><p><strong>Contract Type (Disclaimer)</strong></p><p>This is a <strong>1099 Independent Contractor role</strong>. It is not an employee position. No base salary, payroll deductions, or employee benefits are provided. Compensation is <strong>commission-only</strong>.</p><p><br></p><p><strong>How to Apply</strong></p><p>If you are a proven sales professional with industry connections and ready to grow with a licensed staffing partner:</p><p><br></p><p>Submit your <strong>resume</strong> and a <strong>short cover letter</strong> detailing your staffing sales experience, your book of business, and confirming you are not bound by a non-compete.</p><p> Apply via <strong>www.sigook.com</strong> or email us at <a href=\"mailto:appmanager@sigook.com\" target=\"_blank\"><strong>appmanager@sigook.com</strong></a></p>",
    "requirements": "<ul><li>Proven <strong>B2B sales experience</strong> (staffing, HR services, or related industries preferred).</li><li>Strong <strong>book of business or client network</strong> in logistics, warehousing, or related sectors.</li><li>Excellent <strong>networking, communication, and negotiation skills</strong>.</li><li>Entrepreneurial mindset: highly self-driven, independent, and results-focused.</li><li>Must not be subject to a current <strong>non-compete or restrictive covenant</strong> with another staffing firm.</li><li>Authorized to work in the United States.</li></ul><p><br></p>",
    "responsibilities": "<ul><li>Identify and engage prospective clients in target industries and regions.</li><li>Promote our staffing and recruitment services (temporary, contract, and permanent).</li><li>Develop long-term client partnerships and grow your book of business.</li><li>Operate independently to achieve agreed sales goals.</li><li>Provide updates on pipeline and sales activities when required</li></ul><p><br></p>",
    "shift": "",
    "createdBy": null,
    "agencyId": null,
    "companyType": null
  }
]